qa/qa-artifacts/esb/esb450/mediators/enrich/inline_envelop_sample2.xml

<!--Use Soap UI to send requeset-->

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://ws.apache.org/ns/synapse">
    <registry provider="org.wso2.carbon.mediation.registry.WSO2Registry">
        <parameter name="cachableDuration">15000</parameter>
    </registry>
    <proxy xmlns="http://ws.apache.org/ns/synapse" name="enrichSample2" transports="https,http" statistics="disable" trace="disable" startOnLoad="true">
   <target>
      <inSequence>
         <log level="full" />
         <enrich>
            <source type="inline" clone="true">
               <soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
                  <soapenv:Body>      
                     <p:echoInt xmlns:p="http://echo.services.core.carbon.wso2.org">         
                        <!--0 to 1 occurrence-->            
                           <in xmlns="">1</in>         
                        </p:echoInt>      
                     </soapenv:Body>   
                  </soapenv:Envelope>
               </source>
               <target type="envelope" />
            </enrich>
            <log level="full" />
            <send>
               <endpoint>
                  <address uri="http://localhost:8280/services/echo" />
               </endpoint>
            </send>
         </inSequence>
         <outSequence>
            <send />
         </outSequence>
      </target>
      <publishWSDL uri="http://pavithra-thinkpad-t410:8280/services/echo?wsdl" />
      <description></description>
   </proxy>
    <sequence name="fault">
        <log level="full">
            <property name="MESSAGE" value="Executing default 'fault' sequence"/>
            <property name="ERROR_CODE" expression="get-property('ERROR_CODE')"/>
            <property name="ERROR_MESSAGE" expression="get-property('ERROR_MESSAGE')"/>
        </log>
        <drop/>
    </sequence>
    <sequence name="main">
        <in>
            <log level="full"/>
            <filter source="get-property('To')" regex="http://localhost:9000.*">
                <send/>
            </filter>
        </in>
        <out>
            <send/>
        </out>
    </sequence>
</definitions>


